{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2019-2022): Was on the Dean's list by achieving a term GPA above 3.5",
        "GPA: 3.83/4.0"
      ],
      "degree": "Ontario College Advanced Diploma",
      "department": "T127 Computer Programmer Analyst - School of Computer Technology",
      "duration": "2019-2022",
      "school_name": "George Brown College"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-C-CalvinNguyen",
  "highlighted_projects": [
    {
      "description": "Plays local audio files on Android mobile devices, and the app can also create an account to upload and stream files from the backend server/system. The project uses the MEAN stack that includes technologies such as MongoDB that stores account information once an account is registered. The front-end/client-side mobile application uses Angular/(Ionic); it can read local audio files, stores their metadata into an SQLite local storage, play these files, and connect to the backend server once authenticated. The NodeJS backend server allows users to create accounts, upload audio files onto the server, and stream it back to the user.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Ionic/Angular Mobile Music Player Application \u0026 Streaming System"
    },
    {
      "description": "Allows users to create, manage, search, share, and favorite recipes on the application. Includes other features like planning a meal schedule or creating a shopping list from the ingredient's checklist in a recipe. The project uses Spring for the backend controllers and services, Thymeleaf for the front-end templating engine in HTML/CSS files, and H2 Database that is integrated into Spring automatically through a SQL file.",
      "git_url": null,
      "name": "Spring Cookbook App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Collects the hardware specifications and usage for the Linux nodes within a cluster and stores this data inside the database. The technologies used to achieve this are Docker, PostgreSQL, Bash scripts, and some Linux commands like crontab. Docker manages a container running the PostgreSQL database, and the container is set up using a Bash script (psql_docker.sh). The other Bash scripts (hardware_info.sh and hardware_usage.sh) collect and store the data from the machine using Linux commands like lscpu, vmstat, and psql. Finally, crontab jobs schedule the script's execution every minute.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitor"
    }
  ],
  "name": "Chi Calvin Nguyen",
  "others": [
    {
      "bullets": [
        "Co-operative games like board games or online multiplayer video games.",
        "Brewing beer (Pale ales, IPAs, Stouts)",
        "Ice skating and hockey."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Joined as a Junior Software Developer to learn new technologies by working on projects in an Agile/Scrum environment; the technologies are used within the professional workplace for Jarvis' clients like CIBC. These technologies are, for example, Linux, SQL, Java, Spring, etc.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Hazel's Diner",
      "description": "Worked as a team in a fast-paced environment where communication with coworkers and customers was the key to fulfilling orders and providing excellent service within a given time frame. Responsibilities of the position included bussing food, mixing drinks, cleaning tables, managing dishwashers, and other tasks. I gained certifications such as Smart Serve and First Aid for the position. I learned more about the restaurant's workflow when working alongside the team, and this diversified my responsibilities within the restaurant.",
      "duration": "2018-2020",
      "title": "Bartender/Server"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "HTML/CSS",
      "Python",
      "Agile/Scrum",
      "REST APIs"
    ],
    "familiar": [
      "C#",
      "Spring",
      "ASP.NET",
      "Docker",
      "Linux/Bash"
    ],
    "proficient": [
      "JavaScript",
      "Angular/React",
      "NodeJS",
      "Git",
      "RDBMS/SQL"
    ]
  },
  "summary": "Greetings, feel free to call me Calvin. I am a dedicated team player who is inquisitive, likes to keep a firm schedule, and mostly goes by the books with some flexibility if necessary. I recently graduated from the Computer Programmer Analyst program at George Brown College with an Ontario College Advanced Diploma and a GPA of 3.83/4. Although most of my knowledge of the tech/IT industry comes from my time at Jarvis and my educational background at George Brown, I have gained other skills outside of this field. My ability to communicate and act as a team player established itself throughout my time as a bartender/server. I worked in a rough fast-paced environment that required me to be on my toes, give the best possible service to customers, and work within a tight-knit team. I'm a fan of hockey and ice skating. I am also quite a hobbyist with hobbies such as brewing beer, where I experiment with recipes to get the best possible batch, which is why I also like tech because I constantly learn, test, and create software. Overall, I'm hoping for an opportunity in the software development industry where I can prove myself as a team member."
}
